In [1]:
import csv
import pandas as pd
import datetime as dt

In [2]:
path = "Resources/Hawaii_calendar.csv"

In [3]:
df1 = pd.read_csv(path)

In [4]:
df1.head()

   listing_id        date available    price
0       85701  2019-10-09         t  $222.00
1       87596  2019-08-27         t  $114.00
2       87596  2019-08-26         t  $114.00
3       87596  2019-08-25         t  $114.00
4       87596  2019-08-24         t  $114.00

In [5]:
df1 = df1.sort_values(by="date",ascending= True)

In [6]:
df1.head()

         listing_id        date available price
8328569    30559393  2018-12-06         f   NaN
2750786    15356339  2018-12-06         f   NaN
2750421    15354845  2018-12-06         f   NaN
2750188    15286504  2018-12-06         f   NaN
5863302    23922173  2018-12-06         f   NaN

In [7]:
df1.dtypes

listing_id     int64
date          object
available     object
price         object
dtype: object

In [8]:
df2 = df1
timefmt = "%Y-%m-%d" 
df2['date'] = pd.to_datetime(df2['date'], format = timefmt, errors='coerce')

In [9]:
df2.head()

         listing_id       date available price
8328569    30559393 2018-12-06         f   NaN
2750786    15356339 2018-12-06         f   NaN
2750421    15354845 2018-12-06         f   NaN
2750188    15286504 2018-12-06         f   NaN
5863302    23922173 2018-12-06         f   NaN

In [10]:
today_dt = dt.date.today()
today = dt.datetime.strftime(today_dt, '%Y-%m-%d')

#extract year, month, and day as integers
todayYear = int(dt.datetime.strftime(today_dt, '%Y'))
todayMonth = int(dt.datetime.strftime(today_dt, '%m'))
todayDay = int(dt.datetime.strftime(today_dt, '%d'))


week_later_dt = dt.date(todayYear, todayMonth, todayDay) + dt.timedelta(days=8)
week_later = dt.datetime.strftime(week_later_dt, '%Y-%m-%d')
week_later

'2018-12-29'

In [11]:
df2 = df2.loc[(df2['date']>=today) & (df2['date']<week_later) & (df2['available']=='t'),:]
df2.head()

         listing_id       date available    price
7719442    29157045 2018-12-21         t  $600.00
1420802     8554592 2018-12-21         t  $171.00
2766286    15286543 2018-12-21         t  $420.00
5711775    23506039 2018-12-21         t  $110.00
8249257    30505002 2018-12-21         t  $155.00

In [12]:
df2['price'].value_counts().head()
df2.dtypes

listing_id             int64
date          datetime64[ns]
available             object
price                 object
dtype: object

In [13]:
df2["new_price"] = df2["price"].str.strip('$')

C:\Users\karth\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [14]:
df2["new_price"] = pd.to_numeric(df2["new_price"],errors='coerce')

C:\Users\karth\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

In [15]:
df2.dtypes

listing_id             int64
date          datetime64[ns]
available             object
price                 object
new_price            float64
dtype: object

In [16]:

bins = [0, 50, 100, 150, 200, 250]

# Create the names for the four bins
group_names = ["Under $50", "$50-100", "$100-150", "$150-200", "$200-250"]

df2["price"] = pd.cut(df2["new_price"], bins, labels=group_names)

C:\Users\karth\Anaconda3\lib\site-packages\ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  import sys

In [18]:
# today_dt
under_50 = []
fifty_100 = []
hundred_150 = []
onefifty_200 = []
twohundred_250 = []

numdays = 8
date_list = [today_dt + dt.timedelta(days=x) for x in range(0, numdays)]

date_list = [dt.datetime.strftime(i, '%Y-%m-%d') for i in date_list]
date_list

for i in date_list:
    prices = df2.loc[df2["date"] == i, "price"].value_counts()
    under_50.append(prices[0])
    fifty_100.append(prices[1])
    hundred_150.append(prices[2])
    onefifty_200.append(prices[3])
    twohundred_250.append(prices[4])

In [20]:
df3 = pd.DataFrame({"Date": date_list, 
                     "Under $50": under_50, 
                     "$50-100": fifty_100, 
                     "$100-150": hundred_150,
                     "$150-200": onefifty_200,
                     "$200-250": twohundred_250
                    })
df3
hawaii_airbnb = df3
# df3.set_index("Date")

In [22]:
hawaii_airbnb

         Date  Under $50  $50-100  $100-150  $150-200  $200-250
0  2018-12-21        251     1102      1074       858       580
1  2018-12-22        198      984       968       710       505
2  2018-12-23        210      931       851       636       488
3  2018-12-24        190      782       633       476       336
4  2018-12-25        162      663       508       362       256
5  2018-12-26        175      615       425       307       205
6  2018-12-27        168      519       352       260       157
7  2018-12-28        153      480       315       227       110